tap "azhuchkov/tools"
tap "harelba/q"
tap "hazelcast/hz"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "moonfruit/tap"
tap "ncruces/tap"
tap "nrlquaker/createzap"
tap "oven-sh/bun"
tap "teamookla/speedtest"
brew "openjdk"
brew "ant"
brew "aria2"
brew "autojump"
brew "bash"
brew "bash-completion@2"
brew "node"
brew "bash-language-server"
brew "bat"
brew "bfg"
brew "black"
brew "bottom"
brew "choose-rust"
brew "clang-format"
brew "cmake"
brew "codespell"
brew "colima"
brew "cpanminus"
brew "croc"
brew "curl"
brew "curlie"
brew "delve"
brew "deno"
brew "di"
brew "direnv"
brew "dog"
brew "dufs"
brew "dust"
brew "eza"
brew "fd"
brew "fdupes"
brew "figlet"
brew "file-formula"
brew "flake8"
brew "fossil"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "git-secret"
brew "subversion"
brew "git-svn"
brew "glab"
brew "gmssl"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "gomodifytags"
brew "gopls"
brew "gost"
brew "gotags"
brew "gotests"
brew "gradle"
brew "grpcurl"
brew "hexyl"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "iperf3"
brew "ipython"
brew "jdtls"
brew "jq"
brew "lazygit"
brew "lrzsz"
brew "lua"
brew "lua-language-server"
brew "luacheck"
brew "make"
brew "marksman"
brew "mas"
brew "maven"
brew "miniserve"
brew "mkcert"
brew "mosh"
brew "mysql-client"
brew "ncdu"
brew "neovim"
brew "neovide"
brew "nmap"
brew "opencc"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@21"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "pigz"
brew "pinentry-mac"
brew "pipgrip"
brew "plantuml"
brew "postgresql@16"
brew "prettier"
brew "proxychains-ng"
brew "pstree"
brew "pup"
brew "pv"
brew "pyright"
brew "qsv"
brew "rcs"
brew "redis"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "ruby"
brew "rust"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "sing-box"
brew "staticcheck"
brew "stylua"
brew "swift-format"
brew "tailwindcss-language-server"
brew "taplo"
brew "tcping"
brew "telnet"
brew "testssl"
brew "tmux"
brew "tokei"
brew "tomcat-native"
brew "tomcat@9"
brew "typescript"
brew "typescript-language-server"
brew "ugrep"
brew "vale"
brew "vscode-langservers-extracted"
brew "wget"
brew "whalebrew"
brew "xh"
brew "xq"
brew "yaml-language-server"
brew "yarn"
brew "you-get"
brew "yq"
brew "yt-dlp"
brew "zsh"
brew "azhuchkov/tools/tunblkctl"
brew "harelba/q/q"
brew "hazelcast/hz/hazelcast"
brew "hazelcast/hz/hazelcast-management-center"
brew "mongodb/brew/mongodb-community", args: ["without-mongodb-database-tools", "without-mongosh"]
brew "moonfruit/tap/geo"
brew "moonfruit/tap/gost@3"
brew "moonfruit/tap/impl"
brew "moonfruit/tap/macos-totp-cli"
brew "moonfruit/tap/openssl@1.0"
brew "moonfruit/tap/sshpass"
brew "moonfruit/tap/tscurl"
brew "moonfruit/tap/uutils-selected"
brew "moonfruit/tap/wlp-webprofile8"
brew "ncruces/tap/zenity"
brew "oven-sh/bun/bun"
brew "teamookla/speedtest/speedtest"
cask "adrive"
cask "aldente"
cask "alfred"
cask "appcleaner"
cask "authy"
cask "baidunetdisk"
cask "bartender"
cask "battle-net", args: { language: "en" }
cask "betterdisplay"
cask "betterzip"
cask "canon-mf-ufr2-printer"
cask "chatgpt"
cask "coteditor"
cask "dash"
cask "datagrip"
cask "epic-games"
cask "firefox", args: { language: "zh" }
cask "fleet"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-light"
cask "font-pinyin-regular"
cask "font-pinyin-step"
cask "font-sarasa-gothic"
cask "geogebra"
cask "gmcurl"
cask "goland"
cask "google-chrome"
cask "graalvm-jdk"
cask "hammerspoon"
cask "hstracker"
cask "httpie"
cask "iina"
cask "imazing"
cask "imgotv"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2@beta"
cask "keystore-explorer"
cask "lantern"
cask "launchcontrol"
cask "mitmproxy"
cask "mongodb-compass"
cask "motrix"
cask "mumuplayer"
cask "neteasemusic"
cask "netspot"
cask "orbstack"
cask "parallels"
cask "parallels-toolbox"
cask "protonvpn"
cask "pycharm"
cask "qiyimedia"
cask "qlmarkdown"
cask "qq"
cask "qqlive"
cask "qqmusic"
cask "rar"
cask "rustrover"
cask "sf-symbols"
cask "snipaste"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "suspicious-package"
cask "syntax-highlight"
cask "telegram-desktop"
cask "tencent-meeting"
cask "thunder"
cask "tor-browser"
cask "tunnelblick"
cask "typora"
cask "uu-booster"
cask "visual-studio-code"
cask "visualvm"
cask "wechat"
cask "wechatwork"
cask "whisky"
cask "ximalaya"
cask "zoom"
cask "zulu@8"
mas "Craft", id: 1487937127
mas "Days Matter", id: 494500492
mas "Elmedia Player", id: 937759555
mas "Hand Mirror", id: 1502839586
mas "iMovie 剪辑", id: 408981434
mas "Joystick Mapper", id: 528183797
mas "Keynote 讲演", id: 409183694
mas "MarkMark", id: 6475077023
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers 表格", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages 文稿", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Reeder", id: 1529448980
mas "The Unarchiver", id: 425424353
mas "Userscripts-Mac-App", id: 1463298887
mas "Xcode", id: 497799835
mas "宝宝字帖", id: 6503953628
mas "库乐队", id: 682658836
mas "扫雷", id: 1475921958
mas "超牛 txt 小说阅读器", id: 1344409961
