tap "hazelcast/hz"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "moonfruit/tap", "https://github.com/moonfruit/homebrew-tap.git"
tap "nrlquaker/createzap"
brew "openjdk"
brew "ant"
brew "aria2"
brew "autojump"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bfg"
brew "black"
brew "choose-rust"
brew "clang-format"
brew "cmake"
brew "codespell"
brew "croc"
brew "curl"
brew "delve"
brew "di"
brew "direnv"
brew "dog"
brew "dufs"
brew "eslint"
brew "exa"
brew "fd"
brew "fdupes"
brew "figlet"
brew "file-formula"
brew "flake8"
brew "gawk"
brew "geoipupdate"
brew "git"
brew "git-lfs"
brew "subversion"
brew "git-svn"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gomodifytags"
brew "gopls"
brew "gost"
brew "gotags"
brew "gotests"
brew "gotop"
brew "gradle"
brew "hexyl"
brew "htop"
brew "httpie"
brew "iftop"
brew "iperf3"
brew "ipython"
brew "jq"
brew "lua"
brew "macos-trash"
brew "mas"
brew "maven"
brew "miniserve"
brew "mitmproxy"
brew "mosh"
brew "ncdu"
brew "neovim"
brew "openjdk@11"
brew "openjdk@8"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "pigz"
brew "pinentry-mac"
brew "pipgrip"
brew "prettier"
brew "pstree"
brew "pup"
brew "pv"
brew "qsv"
brew "rcs"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "swiftformat"
brew "swiftlint"
brew "tcping"
brew "terminal-notifier"
brew "testssl"
brew "tmux"
brew "tokei"
brew "tomcat-native"
brew "tomcat@8"
brew "tomcat@9"
brew "typescript"
brew "ugrep"
brew "wget"
brew "xq"
brew "yarn"
brew "ykdl"
brew "youtube-dl"
brew "yq"
brew "zsh"
brew "hazelcast/hz/hazelcast"
brew "hazelcast/hz/hazelcast-management-center"
brew "mongodb/brew/mongodb-community"
brew "moonfruit/tap/colorsvn"
brew "moonfruit/tap/ethr"
brew "moonfruit/tap/openssl@1.0"
brew "moonfruit/tap/sshpass"
brew "moonfruit/tap/wlp-webprofile8"
cask "adrive"
cask "alfred"
cask "aliwangwang"
cask "appcleaner"
cask "authy"
cask "avibrazil-rdm"
cask "baidunetdisk"
cask "bartender"
cask "betterzip"
cask "charles"
cask "cheatsheet"
cask "clashx"
cask "dash"
cask "deepl"
cask "docker"
cask "firefox", args: { language: "zh" }
cask "fliqlo"
cask "font-jetbrains-mono-light"
cask "font-jetbrains-mono-nerd-light"
cask "font-source-han-sans-cn"
cask "google-chrome"
cask "hammerspoon"
cask "hstracker"
cask "httpie"
cask "iina"
cask "imazing"
cask "intel-power-gadget"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2-beta"
cask "keystore-explorer"
cask "lantern"
cask "launchcontrol"
cask "michaelvillar-timer"
cask "microsoft-teams"
cask "mongodb-compass"
cask "neteasemusic"
cask "parallels"
cask "parallels-toolbox"
cask "paw"
cask "pycharm"
cask "qlmarkdown"
cask "qlstephen"
cask "qq"
cask "qqmusic"
cask "quicklook-csv"
cask "rar"
cask "sf-symbols"
cask "snipaste"
cask "steam"
cask "suspicious-package"
cask "swiftformat-for-xcode"
cask "syntax-highlight"
cask "telegram-desktop"
cask "tencent-lemon"
cask "tencent-meeting"
cask "thunder"
cask "tickeys"
cask "tor-browser", args: { language: "zh-CN" }
cask "tunnelblick"
cask "tuxera-ntfs"
cask "typora"
cask "uu-booster"
cask "visual-studio-code"
cask "visualvm"
cask "wechat"
cask "wechatwork"
cask "wireshark"
cask "xbox360-controller-driver-unofficial"
cask "ximalaya"
cask "yacreader"
cask "zoom"
mas "Craft", id: 1487937127
mas "Days Matter", id: 494500492
mas "DwellClick", id: 402414007
mas "Elmedia Player", id: 937759555
mas "Joystick Mapper", id: 528183797
mas "Keynote 讲演", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Reeder", id: 1529448980
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "华为手机助手", id: 1232508288
mas "超牛 txt 小说阅读器", id: 1344409961
