tap "burntsushi/ripgrep", "https://github.com/BurntSushi/ripgrep.git"
tap "ethereum/ethereum"
tap "graalvm/tap"
tap "mongodb/brew"
brew "apache-spark"
brew "burntsushi/ripgrep/ripgrep-bin"
brew "dmalloc"
brew "ethereum"
brew "geckodriver"
brew "ipython"
brew "jemalloc"
brew "jupyterlab"
brew "libmemcached"
brew "mariadb"
brew "memcached"
brew "mongodb/brew/mongodb-community"
brew "pipx"
brew "proxychains-ng"
brew "redis"
cask "chromedriver"
